sn-induction_2D/openfoam_template_steady/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    freeSurf
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    crucibleSide
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    crucibleBot
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    crysInter
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }   
    
    axis
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    } 
    
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
